package JavaMission04;

/**
 *
 * ## ---------------------------------------------
## 자바 미션 #4 : 상속, 다형성
## ---------------------------------------------

##프로그램, 실행 결과를 이름.pdf 로 작성해서 제출
## TODO :

요구사항
학생정보는 학생번호, 이름, 전화번호, 소속학과 있다
학생의 정보를 확인할 수 있다.

교사정보는 교사번호, 이름, 전화번호, 담당과목있다.
교사의 정보를 확인할 수 있다.

학생과 교사의 전화번호를 수정할 수 있다.


1. 다음 요구사항에 만족하는 클래스를 설계해서 이미지로 저장, 단 상속을 고려

2. 테스트 항목 
학생과 교사의 정보를 각각 2명씩 입력 (총 4명 입력하는 순서는 상관없음) - 생성자를 통해 초기화
입력된 사람의 모든 정보를 확인
입력된 사람의 정보중에 이름만 확인
입력된 선생님의 담당 과목 확인
SchoolTest.java로 구현
-- main() 메서드에서 코드 구현.

3. 요구사항, 설계, 코드, 실행 결과, 메모리 구조순으로 pdf를 작성해서 제출 

 */