package JavaMission03;

/**
 *## ---------------------------------------------
## 자바 미션 #3 : 클래스 , 캡슐화, 생성자   
## ---------------------------------------------

##프로그램, 실행 결과를 이름.pdf 로 작성해서 제출
## TODO :

요구사항1
학생정보는 학생번호, 이름, 전화번호, 소속학과 있다
학생의 정보를 확인할 수 있다.

요구사항 2
교사정보는 교사번호, 이름, 전화번호, 담당과목있다.
교사의 정보를 확인할 수 있다.

요구사항 3
학생과 교사의 전화번호를 수정할 수 있다.


1. 다음 요구사항에 만족하는 클래스를 설계해서 이미지로 저장

2. 학생과 교사의 정보를 생성자를 통해 입력(초기화)하고 확인 하는 과정을 SchoolTest.java로 구현
-- main() 메서드에서 코드 구현.

3. 요구사항, 설계, 코드, 실행 결과, 메모리 구조(요구사항1번) 순으로 pdf를 작성해서 제출  
 */
